print("<<<방탈출하기>>>")
print("공지: <<당신의 생존 여부는 오로지 당신의 선택에 달려있습니다.>>")

print("---------------------------------------------------------")

print("당신은 어느 폐쇄된 방에서 눈을 떴습니다. 왜 여기에서 눈을 떴는지는 기억하지 못합니다, 그러나 여기에서 나가야되는 것 한가지는 기억이 납니다.")
input("당신의 이름을 알려주세요:")

print("눈을 뜨니 당신 손목에는 기계가 씌여있습니다. 그 기계 화면에는 다음과 같이 써져있습니다.")
print("한 도로에서 차가 막히고 있다. 이 2차선 도로는 아슬아슬하게 차 2대가 지나갈 정도로 좁다.'''1시간 정체되면 100대, 2시간이면 차량 200대가 막혀 버린다. 오직 자동차로 인해서만 교통체증이 발생할 경우, 3시간의 정체를 발생시키려면 최소 몇대의 차량이 필요할까?'''")
#num = int(input("정답을 입력하시오:"))
num = int(input("정답을 입력하시오:"))
        
if num==1:
        print("철컥 소리와 함께 족쇄가 풀렸습니다.")
#break
else:
        print("족쇄가 폭발해 당신은 죽었습니다.")
        #elif num>1:
                #print("족쇄가 폭발해 당신은 죽었습니다.")
#break:

if num==1:
        print(" 족쇄가 풀려난 당신은 주변을 둘러봅니다. '''주변은 어느 고풍스러운 저택의 침실처럼 꾸며져 있었으며 온통 빨간색으로 꾸며져있습니다. 당신은 나가기 위해 문은 열려했지만 잠겨있었고 아무리 문릉 부수려해도 흠집도 나지 않았습니다.'''")
            
      





      
